#一、單一樣本平均數檢定
#1.z檢定：輪軸直徑平均5公分，標準差1公分，檢測是否等於5公分 
x=c(3.801895,5.214785,5.445979,4.293448,7.401404,
4.156799,6.029400,3.982314,3.605331,4.707879,
4.087529,4.635022,5.597247,3.889285,6.268631,
6.304441,5.565396,5.380210,1.754372,5.449418)
u.test<-function(x,mu,thegma)  # 雙尾檢定
{  Se=thegma/sqrt(length(x))
   u=(mean(x)-mu)/Se    # 樣本平均減去檢定值 除以標準差
   p=2*(1-pnorm(abs(u)))
   c(u=u, p=p)
}
u.test(x,5,1)

#2. 母體變異數已知：z檢定。每加侖可跑25公里，標準差2.4公里，檢測是否大於25公里
b=c(22,24,21,24,23,24,23,22,21,25)
u.test<-function(x,mu,thegma)  # 單尾檢定
{  Se=thegma/sqrt(length(x))
   u=(mean(x)-mu)/Se    # 樣本平均減去檢定值 除以標準差
   p=pnorm(u)
   c(u=u, p=p)
}
u.test(b, 25,2.4)

#3. 母體變異數未知：t檢定
x=c(502,496,510,508,506,498,512,497,515,503,510,506)
t.test(x,mu=500,alternative ="greater")    

#4. 變異數檢定：卡方檢定。檢定污水處理後有毒物質，抽樣20個，平均500ug，變異數是否等於20ug
x=c(512.952899108198, 503.85274864927, 495.06951127009, 477.193305294993, 
509.400520346022, 493.249014260413, 492.456674317536, 530.078195416527, 
498.757258963417, 522.657000900506, 510.041124496973, 490.505063978937, 
536.24855605503, 530.039965979141, 495.559165160148, 466.840695851664, 
510.702680801237, 524.485012890925, 490.37616974915, 485.579333872921
)
var.test1<-function(x, sigma2){
  n<-length(x)
  S2=var(x)
  df=n-1
  chi2<-df*S2/sigma2;
  P<-pchisq(chi2,df)
  data.frame(var=S2, df=df, chisq2=chi2, P_value=P)
}
var.test1(x,400)



#二、雙樣本檢定
#1. 變異數檢定：F檢定
x1=c(24, 29, 39, 40, 32, 32, 31, 44, 37, 37, 50, 28, 24, 48, 25, 
     40, 32, 34, 35, 41)
x2=c(44, 34, 36, 38, 30, 30, 35, 38, 40, 46, 38, 35, 38, 36, 38, 
     40, 34, 37, 40, 46)
var.test(x1,x2)


#2. 獨立樣本平均數檢定：t檢定
x1=c(48,47,44,45,46,47,43,47,42,48)
x2=c(36,45,47,38,39,42,36,42,46,35)
t.test(x1,x2)

#3. 相依樣本平均數檢定：t檢定
before = c(94.5,101,110,103.5,97,88.5,96.5,101,104,116.5)
after = c(85,89.5,101.5,96,86,80.5,87,93.5,93,102)
t.test(before,after,paired=T)
